"espk" = "Port speaker Apple";
"ispk" = "Terbina dalam";
"emic" = "Port mikrofon";
"imic" = "Terbina dalam";
"hdpn" = "Port fon kepala";
"lini" = "Port talian masuk audio";
"lino" = "Port talian keluar audio";
"spdi" = "Port digital masuk optikal";
"spdo" = "Port digital keluar optikal";
"pci " = "Kad PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Peranti rangkaian";
"blue" = "Bluetooth";
"bluh" = "Fon Kepala Bluetooth";
"blus" = "Headset Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
